# Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов.
s = input()

print("Количество слов: " +  str(1 + s.count(' ')))


